app/views/static_pages/welcome.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
                <div class="card-body">
                  <h5 class="text-warning" class="card-title"><%= gossip.user.first_name %></h5>