app/views/gossips/index.html.erb

                  <div class="card-body">
                    <h5 class="text-info" class="card-title"><%= gossip.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]