app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
								    <h1 class="text-danger"> Title : <%= @gossip.title %></h1></br>
								    <p><b>Author</b> : <a href="/users/<%=@user.id%>"> <%= @gossip.user.first_name%> <%= @gossip.user.last_name%></a></p></br>