app/controllers/gossips_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aaa"], ["content", "aaaa"], ["user_id", 10], ["created_at", "2019-02-06 12:10:22.920409"], ["updated_at", "2019-02-06 12:10:22.920409"]]
---
  def create
    @gossip = Gossip.new(:user => User.find(10), :title => params[:title], :content => params[:content]) # avec xxx qui sont les données obtenues à partir du formulaire

    if @gossip.save # essaie de sauvegarder en base @gossip

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])
    @user = Gossip.find(params[:id]).user