app/controllers/static_pages_controller.rb

  def welcome
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def gossipdetails
    @gossip = Gossip.find(params[:id])
    @user = Gossip.find(params[:id]).user
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def authordetails
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]