app/controllers/users_controller.rb

  def create
    @user = User.new(first_name: params[:first_name], last_name: params[:last_name], description: params[:description], email: params[:email], age: params[:age], password: params[:password], city_id: City.all.sample.id)
---
SELECT "cities".* FROM "cities"